src/DataProcessors/ОтладкаВыгрузкиЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОтладкаВыгрузкиЗагрузки</Name>
			<Comment>SD-86203</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗД_ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогРазборки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяРасширения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/зд_АктуальнаяПлатформа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>зд_АктуальнаяПлатформа</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Платформа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.здПлатформы1С</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/ОтладкаВыгрузкиЗагрузки/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// Возвращает сведения о внешней обработке.
//
// Возвращаемое значение:
//   Структура - Подробнее см. ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке().
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПредставлениеОбъекта	=	"Автономный сервер работа с конф.";	
	
	ОписаниеИзменений	=	"
	|25/02/25			-	Создание разработчик:ДанилинВИ / ид.польз. хранилища:Администратор 
	|		
	|";
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	ПараметрыРегистрации.Наименование		= ПредставлениеОбъекта;	
	ПараметрыРегистрации.Информация 		= ОписаниеИзменений;
	ПараметрыРегистрации.Вид 				= ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Версия 			= "25/02/25";
	ПараметрыРегистрации.БезопасныйРежим 	= Ложь; //Истина;
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = НСтр("ru = '"+ПредставлениеОбъекта+"'");
	Команда.Идентификатор = "ИнтерактивнаяЗагрузка";
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение = Ложь;
	
	//Команда = ПараметрыРегистрации.Команды.Добавить();
	//Команда.Представление = НСтр("ru = 'Фоновая обработка'");
	//Команда.Идентификатор = "ФоноваяЗагрузка";
	//Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	//Команда.ПоказыватьОповещение = Истина;
	
	Возврат ПараметрыРегистрации;

КонецФункции

// Обработчик серверных команд.
//
// Параметры:
//   ИдентификаторКоманды - Строка - Имя команды, определенное в функции СведенияОВнешнейОбработке().
//   ОбъектыНазначения    - Массив - Ссылки объектов, для которых вызвана команда.
//       - Неопределено - для команд "ЗаполнениеФормы".
//   ПараметрыВыполнения  - Структура - Контекст выполнения команды.
//       * ДополнительнаяОбработкаСсылка - СправочникСсылка.ДополнительныеОтчетыИОбработки - Ссылка обработки.
//           Может использоваться для чтения параметров обработки.
//           Пример см. в комментарии к функции ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы().
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды) Экспорт
	ДатаЗавершенияВМиллисекундах = ТекущаяУниверсальнаяДатаВМиллисекундах() + 4;
	
	Если ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована Тогда 
		ВызватьИсключение НСтр("ru = 'Запуск обмена невозможен, работа с внешними ресурсами заблокирована!'");
	КонецЕсли;
	
	////ЗаписьЖурналаРегистрации(ИдентификаторКоманды, УровеньЖурналаРегистрации.Предупреждение, 
	////	Метаданные.Обработки.УниверсальныйОбменДаннымиXML, ИдентификаторКоманды, 
	////	СтрокаСоединенияИнформационнойБазы, РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
	
	Если ИдентификаторКоманды = "ФоноваяЗагрузка" Тогда
		ФоноваяЗагрузка();
	Иначе
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Команда ""%1"" не поддерживается обработкой ""%2""'"),
			ИдентификаторКоманды,
			Метаданные().Представление());
	КонецЕсли;
	
	// Имитация длительной операции.
	Пока ТекущаяУниверсальнаяДатаВМиллисекундах() < ДатаЗавершенияВМиллисекундах Цикл
	КонецЦикла;
КонецПроцедуры

// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обработчик команд ФоноваяЗагрузка.
Процедура ФоноваяЗагрузка() Экспорт 
	
	////ТекущаяДата = НачалоДня(ТекущаяДата());
	////
	////ДатаНачала = Макс(ТекущаяДата - 2 * 86400, '20180701');
	////ДатаОкончания = Макс(ТекущаяДата, '20180701') - 1;
	////

	
КонецПроцедуры

#КонецОбласти


Функция глПолучитьКаталог(Кат)
  Возврат ?(ПустаяСтрока(Кат)=0, ?(Прав(СОКРП(Кат),1)<>"\",СОКРЛП(Кат)+"\",СОКРЛП(Кат)),"");
КонецФункции

//Команды:
//export  - выгрузка в хмл
//sync - синхронизация файлов
//import - загрузка из хмл
//save - сохранить в cf
//load - загрузить из  cf
//apply - обновит конфигурацию базы данных (с выполнением, при необходимости, реструктуризации базы данных).
//dump - выгрузка dt   
//restore - восстановить
Процедура ВыполнитьСценарийАвтономногоСервера(ИнформационнаяБаза,Команда,знач РабочийКаталог,ИмяРасширения="") Экспорт
	
	Ковычка = Символ(34); 
	КодВозврата = "999";		    
	КодировкаЗаписи = "cp866";
	
	мНачалоСценария = ТекущаяДата(); 
	КомандаХМЛ = Новый Массив;
	КомандаХМЛ.Добавить("export");	
	КомандаХМЛ.Добавить("sync");
	КомандаХМЛ.Добавить("import"); 
	
	КомандаДТ = Новый Массив;
	КомандаДТ.Добавить("dump");	
	КомандаДТ.Добавить("restore");
	
	КомандаForce = Новый Массив;
	КомандаForce.Добавить("apply");	
	КомандаForce.Добавить("check");

	КомандаВыводФайла = Новый Массив;	
	КомандаВыводФайла.Добавить("save");
	КомандаВыводФайла.Добавить("saveExt");	
	КомандаВыводФайла.Добавить("load");	
	КомандаВыводФайла.Добавить("dump");	
		
	
	РабочийКаталог = глПолучитьКаталог(РабочийКаталог);
	
	ЭтоДТ_Команда 		= КомандаДТ.Найти(Команда)<>Неопределено;	
	ЭтоХМЛ_Команда 		= КомандаХМЛ.Найти(Команда)<>Неопределено;	
	ЭтоForce_Команда 	= КомандаForce.Найти(Команда)<>Неопределено;	
	ЭтоВыводФайла_Команда 	= КомандаВыводФайла.Найти(Команда)<>Неопределено;	
	
	Если не ПроверитьНаличиеФайла(РабочийКаталог) Тогда
		СоздатьКаталог(РабочийКаталог);
		ОбщегоНазначения.СообщитьПользователю(""+РабочийКаталог+" - создан!");
	КонецЕсли;   
	
	КаталогВыгрузкиXML = РабочийКаталог + "cfg_xml";	
	Если ЭтоХМЛ_Команда и 
		не ПроверитьНаличиеФайла(КаталогВыгрузкиXML) Тогда
		
		СоздатьКаталог(КаталогВыгрузкиXML);
		ОбщегоНазначения.СообщитьПользователю(""+КаталогВыгрузкиXML+" - создан!");		
	КонецЕсли;	
	
	РеквизитыИБ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИнформационнаяБаза,"ИмяБазы,ПортАвтономногоСервера,ЛогинБазы,ПарольБазы");	
	
	//Платформа
	ТекПлатформа = РегистрыСведений.зд_АктуальнаяПлатформа.ПолучитьПоследнее(ТекущаяДата()).Платформа;   
	Версия1С = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекПлатформа,"ПутьКПлатформе1С");
	Версия1С = СтрЗаменить(Версия1С,"1cv8.exe","ibcmd.exe");  
	
	ИмяФайла_ibcmd =  Команда+"_"+РеквизитыИБ.ИмяБазы;	
	ИмяБатФайла = ИмяФайла_ibcmd + ".bat";
	ИмяlogФайла = РабочийКаталог+ИмяФайла_ibcmd+?(ПустаяСтрока(ИмяРасширения),"","_"+ИмяРасширения)+ ".log";
		
	Если ПустаяСтрока(ИмяФайла1С) Тогда
		ИмяФайла1С = РеквизитыИБ.ИмяБазы+?(ПустаяСтрока(ИмяРасширения),"","_"+ИмяРасширения)+?(ЭтоДТ_Команда,".dt",?(ПустаяСтрока(ИмяРасширения),".cf",".cfe"));
	КонецЕсли;	
		
	КонфигурационныйФайл = КаталогВременныхФайлов() + РеквизитыИБ.ИмяБазы + ".yml"; 		
	КонфигурационныйФайл = АвтономныйСервер.СоздатьКонфигурационныйФайл(Версия1С,РеквизитыИБ.ИмяБазы, КонфигурационныйФайл, Ложь, ?(РеквизитыИБ.ПортАвтономногоСервера=0,Неопределено,РеквизитыИБ.ПортАвтономногоСервера)); 
	
	Если НЕ ПроверитьНаличиеФайла(КонфигурационныйФайл) Тогда
		ОбщегоНазначения.СообщитьПользователю("(Отмена скрипта)не создан конф. файл: "+КонфигурационныйФайл);	
		Возврат;
	КонецЕсли;
	
	МассивКомманд = Новый Массив;
	МассивКомманд.Добавить(Ковычка+Версия1С+Ковычка);
	
	//БатФайл.ДобавитьСтроку("%v8% infobase dump -c " + КонфигурационныйФайл + " " + ПутьВыгрузки + "\" + ИмяБазы + "\1cv8.dt -u " + ЛогинБазы + " -P " + ПарольБазы);
	
	//echo off
	//"C:\Program Files\1cv8\8.3.27.1859\bin\ibcmd.exe" infobase config save --user=prog1C --password=GY9xolug --config=D:\Data1C\temp\ERP_work_arvaninov.yml --extension=ExtDopFunkcional E:\sborka\ERP_work_arvaninov\ExtDopFunkcional.cfu >E:\sborka\ERP_work_arvaninov\save_ExtDopFunkcional.log
	
	Если ЭтоДТ_Команда Тогда
		МассивКомманд.Добавить("infobase "+Команда);				
	Иначе		
		Если Команда="sync" Тогда
			МассивКомманд.Добавить("infobase config export");		
		Иначе
			МассивКомманд.Добавить("infobase config "+Команда);			
		КонецЕсли;			
	Конецесли;
		
	МассивКомманд.Добавить("--user="+РеквизитыИБ.ЛогинБазы);
	МассивКомманд.Добавить("--password="+РеквизитыИБ.ПарольБазы);
	
	Если Команда="sync" Тогда
		МассивКомманд.Добавить("--sync="+КонфигурационныйФайл);	
	КонецЕсли;
	
	МассивКомманд.Добавить("--config="+КонфигурационныйФайл);
	
	Если не ПустаяСтрока(ИмяРасширения) Тогда
		МассивКомманд.Добавить("--extension="+ИмяРасширения);
	КонецЕсли;	
	
	Если ЭтоХМЛ_Команда Тогда
		МассивКомманд.Добавить(КаталогВыгрузкиXML);
	ИначеЕсли ЭтоВыводФайла_Команда Тогда
		МассивКомманд.Добавить(РабочийКаталог+ИмяФайла1С);		
	КонецЕсли; 
	
	Если ЭтоForce_Команда Тогда
		МассивКомманд.Добавить("--force");		
	КонецЕсли;
	
	МассивКомманд.Добавить(">"+ИмяlogФайла);
	
	стрКоманда = СтрСоединить(МассивКомманд," "); 	
	
	БатФайл = Новый ТекстовыйДокумент;	
	БатФайл.ДобавитьСтроку("echo off");
	БатФайл.ДобавитьСтроку(стрКоманда);
	БатФайл.Записать(РабочийКаталог+ИмяБатФайла, КодировкаЗаписи);
	ЗапуститьПриложение(ИмяБатФайла, РабочийКаталог, Истина, КодВозврата);
	Сообщить("("+КодВозврата+") Начало:"+мНачалоСценария+" - завершено: "+ТекущаяДата());	
	   
	//чтение логов  
	мТекстФайла="";
	Если ПроверитьНаличиеФайла(ИмяlogФайла) Тогда
		мТекстФайла = "";
		ТекстФайл = новый Файл(ИмяlogФайла);
		Если ТекстФайл.Существует() Тогда
			Текст = Новый ТекстовыйДокумент;	
			Текст.Прочитать(ИмяlogФайла,КодировкаТекста.UTF8);	
			мТекстФайла = Текст.ПолучитьТекст();
		КонецЕсли;
		Сообщить(""+ИмяlogФайла+": "+Символы.ПС+мТекстФайла);  
	КонецЕсли;    
	ЗаписьЖурналаРегистрации("АвтономныйСервер."+Команда,?(КодВозврата=0,УровеньЖурналаРегистрации.Информация,УровеньЖурналаРегистрации.Ошибка),Метаданные.Справочники.ЗД_ИнформационныеБазы,ИнформационнаяБаза,""+мНачалоСценария+"-"+ТекущаяДата()+" "+мТекстФайла);
	
		
КонецПроцедуры

Функция ПроверитьНаличиеФайла(ИмяФайла)
	Рез = Ложь;
	МойФайл = Новый Файл(ИмяФайла);
	Рез = МойФайл.Существует(); 
	Возврат Рез;
КонецФункции    

Функция ОстановитьИсполнение()
	
	Если Константы.ОстановитьИсполнение.Получить() = Истина Тогда
		
		ТекстСообщения = "Выполнение остановлено пользователем через константу";
		ЗаписьЖурналаРегистрации("Обновление из хранилища",,,,ТекстСообщения);
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Процедура Пауза(Секунд) Экспорт
	
	Для к=1 По Секунд Цикл
		
		Если ОстановитьИсполнение() Тогда
			Прервать;
		КонецЕсли; 
		
		СтрокаЗапроса = "ping -n 2 localhost"; 
		Соединение = Новый COMОбъект("WScript.Shell");
		Соединение.Run(СтрокаЗапроса, 0, -1);	
		
	КонецЦикла;
	
КонецПроцедуры








#КонецЕсли
